* Commandline input in Emacs Org-mode

  * Our goal: to input two integer numbers with the (arbitrary)
    characters ~==++//~ between them.

  * But Emacs will not stop program execution to take input.

  * To pass input data to a file, we can use the ~:cmdline~ code block
    header argument:
    #+begin_example
    C :main yes :includes <stdio.h> :cmdline < inputfile
    #+end_example

  * For the code block [[cmdline]] below to work, you need a file named
    ~inputfile~ in the same directory as the Org-mode file (check this
    in Emacs with ~C-x d~)

  * Org-mode will compile and run the code block with ~C-c C-c~

  * When the ~scanf~ function asks for formatted input, it gets it
    from ~inputfile~.

  * The input in ~inputfile~ must be correctly formatted. In this
    case, it contains only: ~444==++//555~.

  * Note that we only want to print the numbers, not the stuff between
    them. The format of the ~printf~ function has nothing to do with
    the format of the ~scanf~ function.

  #+name: cmdline
  #+begin_src C :main yes :includes <stdio.h> :cmdline < inputfile
    int a,b;
    scanf("%d==++//%d", &a, &b);
    printf("%d %d", a,  b);
  #+end_src

  #+RESULTS: cmdline
  : 444 555

